{
  "page": 6,
  "schema": "941-X",
  "timestamp": "20250611_003525",
  "extracted_data": {
    "form_title": "Form 941-X: Which process should you use?",
    "introductory_text": "Unless otherwise specified in the separate instructions, an underreported employment tax credit or social security tax deferral should be treated like an overreported tax amount. An overreported employment tax credit or social security tax deferral should be treated like an underreported tax amount. For more information, including which process to select on lines 1 and 2, see Correcting an employment tax credit or social security tax deferral in the separate instructions.",
    "instructions_table": [
      {
        "type_of_errors": "Underreported tax amounts ONLY",
        "process_depends_on_when_you_file": "",
        "more_than_90_days_before_expiration": "Use the adjustment process to correct underreported tax amounts.\n• Check the box on line 1.\n• Pay the amount you owe from line 27 by the time you file Form 941-X.",
        "within_90_days_of_expiration": ""
      },
      {
        "type_of_errors": "Overreported tax amounts ONLY",
        "process_depends_on_when_you_file": "The process you use depends on when you file Form 941-X.",
        "more_than_90_days_before_expiration": "If you're filing Form 941-X MORE THAN 90 days before the period of limitations on credit or refund for Form 941 or Form 941-SS expires...\nChoose either the adjustment process or the claim process to correct the overreported tax amounts.\nChoose the adjustment process if you want the amount shown on line 27 credited to your Form 941, Form 941-SS, or Form 944 for the period in which you file Form 941-X. Check the box on line 1.\nOR\nChoose the claim process if you want the amount shown on line 27 refunded to you or abated. Check the box on line 2.",
        "within_90_days_of_expiration": "If you're filing Form 941-X WITHIN 90 days of the expiration of the period of limitations on credit or refund for Form 941 or Form 941-SS...\nYou must use the claim process to correct the overreported tax amounts. Check the box on line 2."
      },
      {
        "type_of_errors": "BOTH underreported and overreported tax amounts",
        "process_depends_on_when_you_file": "The process you use depends on when you file Form 941-X.",
        "more_than_90_days_before_expiration": "If you're filing Form 941-X MORE THAN 90 days before the period of limitations on credit or refund for Form 941 or Form 941-SS expires...\nChoose either the adjustment process or both the adjustment process and the claim process when you correct both underreported and overreported tax amounts.\nChoose the adjustment process if combining your underreported tax amounts and overreported tax amounts results in a balance due or creates a credit that you want applied to Form 941, Form 941-SS, or Form 944.\n• File one Form 941-X, and\n• Check the box on line 1 and follow the instructions on line 27.\nOR\nChoose both the adjustment process and the claim process if you want the overreported tax amount refunded to you or abated.\nFile two separate forms.\n1. For the adjustment process, file one Form 941-X to correct the underreported tax amounts. Check the box on line 1. Pay the amount you owe from line 27 by the time you file Form 941-X.\n2. For the claim process, file a second Form 941-X to correct the overreported tax amounts. Check the box on line 2.",
        "within_90_days_of_expiration": "If you're filing Form 941-X WITHIN 90 days of the expiration of the period of limitations on credit or refund for Form 941 or Form 941-SS...\nYou must use both the adjustment process and the claim process.\nFile two separate forms.\n1. For the adjustment process, file one Form 941-X to correct the underreported tax amounts. Check the box on line 1. Pay the amount you owe from line 27 by the time you file Form 941-X.\n2. For the claim process, file a second Form 941-X to correct the overreported tax amounts. Check the box on line 2."
      }
    ],
    "page_number": "6",
    "form_revision": "Form 941-X (Rev. 4-2022)"
  },
  "field_count": 17,
  "non_null_count": 5
}